{
  "stoi": {
    "<PAD>": 0,
    "<BOS>": 1,
    "<EOS>": 2,
    " ": 3,
    "!": 4,
    "\"": 5,
    "#": 6,
    "$": 7,
    "%": 8,
    "&": 9,
    "'": 10,
    "(": 11,
    ")": 12,
    "*": 13,
    "+": 14,
    ",": 15,
    "-": 16,
    ".": 17,
    "/": 18,
    "0": 19,
    "1": 20,
    "2": 21,
    "3": 22,
    "4": 23,
    "5": 24,
    "6": 25,
    "7": 26,
    "8": 27,
    "9": 28,
    ":": 29,
    ";": 30,
    "=": 31,
    "?": 32,
    "@": 33,
    "A": 34,
    "B": 35,
    "C": 36,
    "D": 37,
    "E": 38,
    "F": 39,
    "G": 40,
    "H": 41,
    "I": 42,
    "J": 43,
    "K": 44,
    "L": 45,
    "M": 46,
    "N": 47,
    "O": 48,
    "P": 49,
    "Q": 50,
    "R": 51,
    "S": 52,
    "T": 53,
    "U": 54,
    "V": 55,
    "W": 56,
    "X": 57,
    "Y": 58,
    "Z": 59,
    "[": 60,
    "]": 61,
    "^": 62,
    "_": 63,
    "`": 64,
    "a": 65,
    "b": 66,
    "c": 67,
    "d": 68,
    "e": 69,
    "f": 70,
    "g": 71,
    "h": 72,
    "i": 73,
    "j": 74,
    "k": 75,
    "l": 76,
    "m": 77,
    "n": 78,
    "o": 79,
    "p": 80,
    "q": 81,
    "r": 82,
    "s": 83,
    "t": 84,
    "u": 85,
    "v": 86,
    "w": 87,
    "x": 88,
    "y": 89,
    "z": 90,
    "": 91,
    "": 92,
    "": 93,
    "": 94,
    "": 95,
    "": 96,
    "": 97,
    " ": 98,
    "¡": 99,
    "£": 100,
    "¥": 101,
    "©": 102,
    "«": 103,
    "­": 104,
    "®": 105,
    "°": 106,
    "²": 107,
    "³": 108,
    "´": 109,
    "¶": 110,
    "º": 111,
    "»": 112,
    "¼": 113,
    "½": 114,
    "¾": 115,
    "Á": 116,
    "Ä": 117,
    "Å": 118,
    "Ç": 119,
    "É": 120,
    "Ö": 121,
    "×": 122,
    "Ü": 123,
    "ß": 124,
    "à": 125,
    "á": 126,
    "â": 127,
    "ã": 128,
    "ä": 129,
    "ç": 130,
    "è": 131,
    "é": 132,
    "ê": 133,
    "ë": 134,
    "í": 135,
    "ï": 136,
    "ñ": 137,
    "ò": 138,
    "ó": 139,
    "ô": 140,
    "ö": 141,
    "ø": 142,
    "ù": 143,
    "ú": 144,
    "ü": 145,
    "ý": 146,
    "ā": 147,
    "ć": 148,
    "Č": 149,
    "ē": 150,
    "ě": 151,
    "ī": 152,
    "œ": 153,
    "š": 154,
    "ū": 155,
    "Ű": 156,
    "β": 157,
    "к": 158,
    "Ӓ": 159,
    "ย": 160,
    "ร": 161,
    "อ": 162,
    "่": 163,
    "‒": 164,
    "–": 165,
    "—": 166,
    "‘": 167,
    "’": 168,
    "‚": 169,
    "“": 170,
    "”": 171,
    "„": 172,
    "‟": 173,
    "…": 174,
    "‹": 175,
    "›": 176,
    "€": 177,
    "™": 178,
    "♪": 179,
    "♫": 180,
    "你": 181,
    "葱": 182,
    "送": 183,
    "﻿": 184,
    "，": 185
  },
  "itos": {
    "0": "<PAD>",
    "1": "<BOS>",
    "2": "<EOS>",
    "3": " ",
    "4": "!",
    "5": "\"",
    "6": "#",
    "7": "$",
    "8": "%",
    "9": "&",
    "10": "'",
    "11": "(",
    "12": ")",
    "13": "*",
    "14": "+",
    "15": ",",
    "16": "-",
    "17": ".",
    "18": "/",
    "19": "0",
    "20": "1",
    "21": "2",
    "22": "3",
    "23": "4",
    "24": "5",
    "25": "6",
    "26": "7",
    "27": "8",
    "28": "9",
    "29": ":",
    "30": ";",
    "31": "=",
    "32": "?",
    "33": "@",
    "34": "A",
    "35": "B",
    "36": "C",
    "37": "D",
    "38": "E",
    "39": "F",
    "40": "G",
    "41": "H",
    "42": "I",
    "43": "J",
    "44": "K",
    "45": "L",
    "46": "M",
    "47": "N",
    "48": "O",
    "49": "P",
    "50": "Q",
    "51": "R",
    "52": "S",
    "53": "T",
    "54": "U",
    "55": "V",
    "56": "W",
    "57": "X",
    "58": "Y",
    "59": "Z",
    "60": "[",
    "61": "]",
    "62": "^",
    "63": "_",
    "64": "`",
    "65": "a",
    "66": "b",
    "67": "c",
    "68": "d",
    "69": "e",
    "70": "f",
    "71": "g",
    "72": "h",
    "73": "i",
    "74": "j",
    "75": "k",
    "76": "l",
    "77": "m",
    "78": "n",
    "79": "o",
    "80": "p",
    "81": "q",
    "82": "r",
    "83": "s",
    "84": "t",
    "85": "u",
    "86": "v",
    "87": "w",
    "88": "x",
    "89": "y",
    "90": "z",
    "91": "",
    "92": "",
    "93": "",
    "94": "",
    "95": "",
    "96": "",
    "97": "",
    "98": " ",
    "99": "¡",
    "100": "£",
    "101": "¥",
    "102": "©",
    "103": "«",
    "104": "­",
    "105": "®",
    "106": "°",
    "107": "²",
    "108": "³",
    "109": "´",
    "110": "¶",
    "111": "º",
    "112": "»",
    "113": "¼",
    "114": "½",
    "115": "¾",
    "116": "Á",
    "117": "Ä",
    "118": "Å",
    "119": "Ç",
    "120": "É",
    "121": "Ö",
    "122": "×",
    "123": "Ü",
    "124": "ß",
    "125": "à",
    "126": "á",
    "127": "â",
    "128": "ã",
    "129": "ä",
    "130": "ç",
    "131": "è",
    "132": "é",
    "133": "ê",
    "134": "ë",
    "135": "í",
    "136": "ï",
    "137": "ñ",
    "138": "ò",
    "139": "ó",
    "140": "ô",
    "141": "ö",
    "142": "ø",
    "143": "ù",
    "144": "ú",
    "145": "ü",
    "146": "ý",
    "147": "ā",
    "148": "ć",
    "149": "Č",
    "150": "ē",
    "151": "ě",
    "152": "ī",
    "153": "œ",
    "154": "š",
    "155": "ū",
    "156": "Ű",
    "157": "β",
    "158": "к",
    "159": "Ӓ",
    "160": "ย",
    "161": "ร",
    "162": "อ",
    "163": "่",
    "164": "‒",
    "165": "–",
    "166": "—",
    "167": "‘",
    "168": "’",
    "169": "‚",
    "170": "“",
    "171": "”",
    "172": "„",
    "173": "‟",
    "174": "…",
    "175": "‹",
    "176": "›",
    "177": "€",
    "178": "™",
    "179": "♪",
    "180": "♫",
    "181": "你",
    "182": "葱",
    "183": "送",
    "184": "﻿",
    "185": "，"
  }
}